#Задан словарь. Напишите программу, которая будет выводить значение по заданному ключу.
#Ключи, чьи значения необходимо найти, должны задаваться с помощью функции input(). Т.к. в данной задаче используется функция input(),
# получение значения ключей типа int не принципиально.
#Подставьте "Входные данные" в свою программу и сравните результат с выходными данными.
#1) Входные данные: {'Hello' : 'Hi', 'Bye' : 'Goodbye', 'List' : 'Array'};
#Параметр для input() : 'Bye'.
#Выходные данные: 'Goodbye'. 
#2) Входные данные: {'beep' : 'car'};
#Параметр для input() : 'beep'.
#Выходные данные: 'car'.
#3) Входные данные: {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5};
#Параметр для input() : 'c'.
#Выходные данные: 3.


data = {"Hello": "Hi", "Bye": "Goodbye", "List": "Array"}
key = input('Параметр:')
print(data[key])

data = {"beep": "car"}
key = input('Параметр:')
print(data[key])

data = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}
key = input("Параметр:")
print(data[key])