#Напишите программу, которая принимает список строк и выводит количество повторений данных строк в списке.
#Необходимо реализовать решение с использованием словарей.
#Подставьте "Входные данные" в свою программу и сравните результат с выходными данными.
#1) Входные данные: ['abc', 'bcd', 'abc', 'abd', 'abd', 'dcd', 'abc'].
#Выходные данные: 3 1 2 1. 
#2) Входные данные: ['aaa', 'bbb', 'ccc'].
#Выходные данные: 1 1 1.
#3) Входные данные: ['abc', 'abc', 'abc'].
#Выходные данные: 3.



lst = ['abc', 'bcd', 'abc', 'abd', 'abd', 'dcd', 'abc']
counts = {}
order = []

for i in lst:
    if i not in counts:
        counts[i] = 1
        order.append(i)
    else:
        counts[i] += 1

results = [str(counts[k]) for k in order]
print(' '.join(results))